{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicy",
    "@odata.id":  "deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)",
    "@odata.editLink":  "deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2024-08-30T10:16:22.1095075Z",
    "creationSource":  null,
    "description":  "",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2024-08-30T10:16:22.1095075Z",
    "name":  "MacOS - S2C - Disk Encryption - D - FileVault - v1.0",
    "platforms@odata.type":  "#microsoft.graph.deviceManagementConfigurationPlatforms",
    "platforms":  "macOS",
    "priorityMetaData":  null,
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "settingCount":  3,
    "technologies@odata.type":  "#microsoft.graph.deviceManagementConfigurationTechnologies",
    "technologies":  "mdm,appleRemoteManagement",
    "id":  "8ce8f9e1-7c98-4b8e-99b4-4f3310f77f83",
    "templateReference":  {
                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
                              "templateId":  "",
                              "templateFamily@odata.type":  "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
                              "templateFamily":  "none",
                              "templateDisplayName":  null,
                              "templateDisplayVersion":  null
                          },
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/assignments",
    "assignments":  [

                    ],
    "settings@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/settings",
    "settings@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/settings/$ref",
    "settings@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/settings",
    "settings":  [
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/settings(\u00270\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/settings(\u00270\u0027)",
                         "id":  "0",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
                                                 "settingInstanceTemplateReference":  null,
                                                 "groupSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.mcx.filevault2_enable",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.mcx.filevault2_enable_0",
                                                                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.mcx.filevault2_forceenableinsetupassistant",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.mcx.filevault2_forceenableinsetupassistant_true",
                                                                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.mcx.filevault2_recoverykeyrotationinmonths",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.mcx.filevault2_recoverykeyrotationinmonths_6",
                                                                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/settings(\u00270\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/settings(\u00270\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/settings(\u00271\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/settings(\u00271\u0027)",
                         "id":  "1",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "com.apple.mcx_com.apple.mcx-fdefilevaultoptions",
                                                 "settingInstanceTemplateReference":  null,
                                                 "groupSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.mcx_dontallowfdedisable",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.mcx_dontallowfdedisable_true",
                                                                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/settings(\u00271\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/settings(\u00271\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/settings(\u00272\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/settings(\u00272\u0027)",
                         "id":  "2",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "com.apple.security.fderecoverykeyescrow_com.apple.security.fderecoverykeyescrow",
                                                 "settingInstanceTemplateReference":  null,
                                                 "groupSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.security.fderecoverykeyescrow_location",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "simpleSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "You can retrieve the personal recovery key for your macOS device from the Microsoft Intune app, Company Portal website, or Company Portal apps for Android and iOS/iPadOS. Support cannot access recovery keys that belong to personal devices."
                                                                                                                                     }
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/settings(\u00272\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/settings(\u00272\u0027)/settingDefinitions"
                     }
                 ],
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/microsoft.graph.assign"
                                },
    "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget":  {
                                                                       "title":  "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
                                                                       "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
                                                                   },
    "#microsoft.graph.createCopy":  {
                                        "title":  "microsoft.graph.createCopy",
                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/microsoft.graph.createCopy"
                                    },
    "#microsoft.graph.reorder":  {
                                     "title":  "microsoft.graph.reorder",
                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/microsoft.graph.reorder"
                                 },
    "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget":  {
                                                                          "title":  "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
                                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
                                                                      },
    "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget":  {
                                                                     "title":  "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
                                                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
                                                                 },
    "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy":  {
                                                                        "title":  "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
                                                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u00278ce8f9e1-7c98-4b8e-99b4-4f3310f77f83\u0027)/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
                                                                    }
}



