{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicy",
    "@odata.id":  "deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)",
    "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2024-08-17T15:20:18.6876505Z",
    "creationSource":  null,
    "description":  "NOTE: This policy requires deployment of the Defender application and a valid Defender for Endpoint P1/P2 or Defender for Business license:\n\nhttps://learn.microsoft.com/en-us/defender-endpoint/mac-install-with-intune",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2024-08-19T14:05:16.3186795Z",
    "name":  "MacOS - S2C - Defender Antivirus - D - MDE Configuration - v1.0",
    "platforms@odata.type":  "#microsoft.graph.deviceManagementConfigurationPlatforms",
    "platforms":  "macOS",
    "priorityMetaData":  null,
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "settingCount":  6,
    "technologies@odata.type":  "#microsoft.graph.deviceManagementConfigurationTechnologies",
    "technologies":  "mdm,appleRemoteManagement",
    "id":  "f9a520f4-f948-48b5-ba81-2a24eb9f3cdc",
    "templateReference":  {
                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
                              "templateId":  "",
                              "templateFamily@odata.type":  "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
                              "templateFamily":  "none",
                              "templateDisplayName":  null,
                              "templateDisplayVersion":  null
                          },
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/assignments",
    "settings@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings",
    "settings@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings/$ref",
    "settings@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings",
    "settings":  [
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00270\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00270\u0027)",
                         "id":  "0",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "com.apple.servicemanagement_com.apple.servicemanagement",
                                                 "settingInstanceTemplateReference":  null,
                                                 "groupSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                                                                              "settingDefinitionId":  "com.apple.servicemanagement_rules",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "groupSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                                                                                                              "groupSettingCollectionValue":  [
                                                                                                                                                  {
                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                      "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                      "children":  [
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.servicemanagement_rules_item_ruletype",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "choiceSettingValue":  {
                                                                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                                                                      "value":  "com.apple.servicemanagement_rules_item_ruletype_3",
                                                                                                                                                                                                      "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                      "children":  [

                                                                                                                                                                                                                   ]
                                                                                                                                                                                                  }
                                                                                                                                                                       },
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.servicemanagement_rules_item_rulevalue",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "simpleSettingValue":  {
                                                                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                                                                      "value":  "com.microsoft.fresno"
                                                                                                                                                                                                  }
                                                                                                                                                                       }
                                                                                                                                                                   ]
                                                                                                                                                  },
                                                                                                                                                  {
                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                      "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                      "children":  [
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.servicemanagement_rules_item_ruletype",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "choiceSettingValue":  {
                                                                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                                                                      "value":  "com.apple.servicemanagement_rules_item_ruletype_3",
                                                                                                                                                                                                      "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                      "children":  [

                                                                                                                                                                                                                   ]
                                                                                                                                                                                                  }
                                                                                                                                                                       },
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.servicemanagement_rules_item_rulevalue",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "simpleSettingValue":  {
                                                                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                                                                      "value":  "com.microsoft.dlp"
                                                                                                                                                                                                  }
                                                                                                                                                                       }
                                                                                                                                                                   ]
                                                                                                                                                  }
                                                                                                                                              ]
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00270\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00270\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00271\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00271\u0027)",
                         "id":  "1",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "com.apple.managedclient.preferences_applicationssystem",
                                                 "settingInstanceTemplateReference":  null,
                                                 "groupSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                                                                              "settingDefinitionId":  "com.apple.managedclient.preferences_applicationssystem_applications_microsoft defender.app",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "groupSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                                                                                                              "groupSettingCollectionValue":  [
                                                                                                                                                  {
                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                      "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                      "children":  [
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.managedclient.preferences_applicationssystem_applications_microsoft defender.app_application id",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "simpleSettingValue":  {
                                                                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                                                                      "value":  "WDAV00"
                                                                                                                                                                                                  }
                                                                                                                                                                       },
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.managedclient.preferences_applicationssystem_applications_microsoft defender.app_lcid",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "simpleSettingValue":  {
                                                                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                                                                      "value":  1033
                                                                                                                                                                                                  }
                                                                                                                                                                       },
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.managedclient.preferences_applicationssystem_applications_microsoft defender.app_manifestserver",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "choiceSettingValue":  {
                                                                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                                                                      "value":  "com.apple.managedclient.preferences_applicationssystem_applications_microsoft defender.app_manifestserver_0",
                                                                                                                                                                                                      "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                      "children":  [

                                                                                                                                                                                                                   ]
                                                                                                                                                                                                  }
                                                                                                                                                                       }
                                                                                                                                                                   ]
                                                                                                                                                  }
                                                                                                                                              ]
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00271\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00271\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00272\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00272\u0027)",
                         "id":  "2",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_com.apple.tcc.configuration-profile-policy",
                                                 "settingInstanceTemplateReference":  null,
                                                 "groupSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                                                                              "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "groupSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                                                                                                              "groupSettingCollectionValue":  [
                                                                                                                                                  {
                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                      "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                      "children":  [
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_accessibility",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "groupSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                                                                                                                                                                           "groupSettingCollectionValue":  [
                                                                                                                                                                                                               {
                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                   "children":  [
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_accessibility_item_allowed",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "choiceSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.apple.tcc.configuration-profile-policy_services_accessibility_item_allowed_true",
                                                                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                                                                   "children":  [

                                                                                                                                                                                                                                                                                ]
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_accessibility_item_authorization",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "choiceSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.apple.tcc.configuration-profile-policy_services_accessibility_item_authorization_0",
                                                                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                                                                   "children":  [

                                                                                                                                                                                                                                                                                ]
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_accessibility_item_coderequirement",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "simpleSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "identifier \"com.microsoft.dlp.daemon\" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9"
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_accessibility_item_identifier",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "simpleSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.microsoft.dlp.daemon"
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_accessibility_item_identifiertype",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "choiceSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.apple.tcc.configuration-profile-policy_services_accessibility_item_identifiertype_0",
                                                                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                                                                   "children":  [

                                                                                                                                                                                                                                                                                ]
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_accessibility_item_staticcode",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "choiceSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.apple.tcc.configuration-profile-policy_services_accessibility_item_staticcode_false",
                                                                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                                                                   "children":  [

                                                                                                                                                                                                                                                                                ]
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    }
                                                                                                                                                                                                                                ]
                                                                                                                                                                                                               }
                                                                                                                                                                                                           ]
                                                                                                                                                                       },
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_bluetoothalways",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "groupSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                                                                                                                                                                           "groupSettingCollectionValue":  [
                                                                                                                                                                                                               {
                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                   "children":  [
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_bluetoothalways_item_allowed",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "choiceSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.apple.tcc.configuration-profile-policy_services_bluetoothalways_item_allowed_true",
                                                                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                                                                   "children":  [

                                                                                                                                                                                                                                                                                ]
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_bluetoothalways_item_authorization",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "choiceSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.apple.tcc.configuration-profile-policy_services_bluetoothalways_item_authorization_0",
                                                                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                                                                   "children":  [

                                                                                                                                                                                                                                                                                ]
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_bluetoothalways_item_coderequirement",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "simpleSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "identifier \"com.microsoft.dlp.daemon\" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9"
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_bluetoothalways_item_identifier",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "simpleSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.microsoft.dlp.daemon"
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_bluetoothalways_item_identifiertype",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "choiceSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.apple.tcc.configuration-profile-policy_services_bluetoothalways_item_identifiertype_0",
                                                                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                                                                   "children":  [

                                                                                                                                                                                                                                                                                ]
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_bluetoothalways_item_staticcode",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "choiceSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.apple.tcc.configuration-profile-policy_services_bluetoothalways_item_staticcode_false",
                                                                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                                                                   "children":  [

                                                                                                                                                                                                                                                                                ]
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    }
                                                                                                                                                                                                                                ]
                                                                                                                                                                                                               }
                                                                                                                                                                                                           ]
                                                                                                                                                                       },
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "groupSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                                                                                                                                                                           "groupSettingCollectionValue":  [
                                                                                                                                                                                                               {
                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                   "children":  [
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_allowed",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "choiceSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_allowed_true",
                                                                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                                                                   "children":  [

                                                                                                                                                                                                                                                                                ]
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_authorization",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "choiceSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_authorization_0",
                                                                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                                                                   "children":  [

                                                                                                                                                                                                                                                                                ]
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_coderequirement",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "simpleSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "identifier \"com.microsoft.wdav\" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9"
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_identifier",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "simpleSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.microsoft.wdav"
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_identifiertype",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "choiceSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_identifiertype_0",
                                                                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                                                                   "children":  [

                                                                                                                                                                                                                                                                                ]
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_staticcode",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "choiceSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_staticcode_false",
                                                                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                                                                   "children":  [

                                                                                                                                                                                                                                                                                ]
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    }
                                                                                                                                                                                                                                ]
                                                                                                                                                                                                               },
                                                                                                                                                                                                               {
                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                   "children":  [
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_allowed",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "choiceSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_allowed_true",
                                                                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                                                                   "children":  [

                                                                                                                                                                                                                                                                                ]
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_authorization",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "choiceSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_authorization_0",
                                                                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                                                                   "children":  [

                                                                                                                                                                                                                                                                                ]
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_coderequirement",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "simpleSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "identifier \"com.microsoft.wdav.epsext\" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9"
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_identifier",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "simpleSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.microsoft.wdav.epsext"
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_identifiertype",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "choiceSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_identifiertype_0",
                                                                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                                                                   "children":  [

                                                                                                                                                                                                                                                                                ]
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_staticcode",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "choiceSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_staticcode_false",
                                                                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                                                                   "children":  [

                                                                                                                                                                                                                                                                                ]
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    }
                                                                                                                                                                                                                                ]
                                                                                                                                                                                                               },
                                                                                                                                                                                                               {
                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                   "children":  [
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_allowed",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "choiceSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_allowed_true",
                                                                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                                                                   "children":  [

                                                                                                                                                                                                                                                                                ]
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_authorization",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "choiceSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_authorization_0",
                                                                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                                                                   "children":  [

                                                                                                                                                                                                                                                                                ]
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_coderequirement",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "simpleSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "identifier \"com.microsoft.dlp.daemon\" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9"
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_identifier",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "simpleSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.microsoft.dlp.daemon"
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_identifiertype",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "choiceSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_identifiertype_0",
                                                                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                                                                   "children":  [

                                                                                                                                                                                                                                                                                ]
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    },
                                                                                                                                                                                                                                    {
                                                                                                                                                                                                                                        "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                                                                                        "settingDefinitionId":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_staticcode",
                                                                                                                                                                                                                                        "settingInstanceTemplateReference":  null,
                                                                                                                                                                                                                                        "choiceSettingValue":  {
                                                                                                                                                                                                                                                                   "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                                                                                   "settingValueTemplateReference":  null,
                                                                                                                                                                                                                                                                   "value":  "com.apple.tcc.configuration-profile-policy_services_systempolicyallfiles_item_staticcode_false",
                                                                                                                                                                                                                                                                   "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                                                                                   "children":  [

                                                                                                                                                                                                                                                                                ]
                                                                                                                                                                                                                                                               }
                                                                                                                                                                                                                                    }
                                                                                                                                                                                                                                ]
                                                                                                                                                                                                               }
                                                                                                                                                                                                           ]
                                                                                                                                                                       }
                                                                                                                                                                   ]
                                                                                                                                                  }
                                                                                                                                              ]
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00272\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00272\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00273\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00273\u0027)",
                         "id":  "3",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "com.apple.system-extension-policy_com.apple.system-extension-policy",
                                                 "settingInstanceTemplateReference":  null,
                                                 "groupSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                                                                              "settingDefinitionId":  "com.apple.system-extension-policy_allowedsystemextensions",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "groupSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                                                                                                              "groupSettingCollectionValue":  [
                                                                                                                                                  {
                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                      "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                      "children":  [
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.system-extension-policy_allowedsystemextensions_generickey",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "simpleSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSimpleSettingValue)",
                                                                                                                                                                           "simpleSettingCollectionValue":  [
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                                                    "settingValueTemplateReference":  null,
                                                                                                                                                                                                                    "value":  "com.microsoft.wdav.epsext"
                                                                                                                                                                                                                },
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                                                    "settingValueTemplateReference":  null,
                                                                                                                                                                                                                    "value":  "com.microsoft.wdav.netext"
                                                                                                                                                                                                                }
                                                                                                                                                                                                            ]
                                                                                                                                                                       },
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.system-extension-policy_allowedsystemextensions_generickey_keytobereplaced",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "simpleSettingValue":  {
                                                                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                                                                      "value":  "UBF8T346G9"
                                                                                                                                                                                                  }
                                                                                                                                                                       }
                                                                                                                                                                   ]
                                                                                                                                                  }
                                                                                                                                              ]
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00273\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00273\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00274\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00274\u0027)",
                         "id":  "4",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "com.apple.notificationsettings_com.apple.notificationsettings",
                                                 "settingInstanceTemplateReference":  null,
                                                 "groupSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                                                                              "settingDefinitionId":  "com.apple.notificationsettings_notificationsettings",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "groupSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                                                                                                              "groupSettingCollectionValue":  [
                                                                                                                                                  {
                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                      "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                      "children":  [
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.notificationsettings_notificationsettings_item_alerttype",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "choiceSettingValue":  {
                                                                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                                                                      "value":  "com.apple.notificationsettings_notificationsettings_item_alerttype_1",
                                                                                                                                                                                                      "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                      "children":  [

                                                                                                                                                                                                                   ]
                                                                                                                                                                                                  }
                                                                                                                                                                       },
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.notificationsettings_notificationsettings_item_badgesenabled",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "choiceSettingValue":  {
                                                                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                                                                      "value":  "com.apple.notificationsettings_notificationsettings_item_badgesenabled_true",
                                                                                                                                                                                                      "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                      "children":  [

                                                                                                                                                                                                                   ]
                                                                                                                                                                                                  }
                                                                                                                                                                       },
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.notificationsettings_notificationsettings_item_bundleidentifier",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "simpleSettingValue":  {
                                                                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                                                                      "value":  "com.microsoft.wdav.tray"
                                                                                                                                                                                                  }
                                                                                                                                                                       },
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.notificationsettings_notificationsettings_item_criticalalertenabled",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "choiceSettingValue":  {
                                                                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                                                                      "value":  "com.apple.notificationsettings_notificationsettings_item_criticalalertenabled_false",
                                                                                                                                                                                                      "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                      "children":  [

                                                                                                                                                                                                                   ]
                                                                                                                                                                                                  }
                                                                                                                                                                       },
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.notificationsettings_notificationsettings_item_notificationsenabled",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "choiceSettingValue":  {
                                                                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                                                                      "value":  "com.apple.notificationsettings_notificationsettings_item_notificationsenabled_true",
                                                                                                                                                                                                      "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                      "children":  [

                                                                                                                                                                                                                   ]
                                                                                                                                                                                                  }
                                                                                                                                                                       },
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.notificationsettings_notificationsettings_item_showinlockscreen",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "choiceSettingValue":  {
                                                                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                                                                      "value":  "com.apple.notificationsettings_notificationsettings_item_showinlockscreen_false",
                                                                                                                                                                                                      "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                      "children":  [

                                                                                                                                                                                                                   ]
                                                                                                                                                                                                  }
                                                                                                                                                                       },
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.notificationsettings_notificationsettings_item_showinnotificationcenter",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "choiceSettingValue":  {
                                                                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                                                                      "value":  "com.apple.notificationsettings_notificationsettings_item_showinnotificationcenter_true",
                                                                                                                                                                                                      "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                      "children":  [

                                                                                                                                                                                                                   ]
                                                                                                                                                                                                  }
                                                                                                                                                                       },
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.notificationsettings_notificationsettings_item_soundsenabled",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "choiceSettingValue":  {
                                                                                                                                                                                                      "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                                                                      "value":  "com.apple.notificationsettings_notificationsettings_item_soundsenabled_true",
                                                                                                                                                                                                      "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                                                                                      "children":  [

                                                                                                                                                                                                                   ]
                                                                                                                                                                                                  }
                                                                                                                                                                       }
                                                                                                                                                                   ]
                                                                                                                                                  }
                                                                                                                                              ]
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00274\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00274\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00275\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00275\u0027)",
                         "id":  "5",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "com.apple.webcontent-filter_com.apple.webcontent-filter",
                                                 "settingInstanceTemplateReference":  null,
                                                 "groupSettingCollectionValue@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationGroupSettingValue)",
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.webcontent-filter_filterdataproviderbundleidentifier",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "simpleSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.microsoft.wdav.netext"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.webcontent-filter_filterdataproviderdesignatedrequirement",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "simpleSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "identifier \"com.microsoft.wdav.netext\" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.webcontent-filter_filtergrade",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.webcontent-filter_filtergrade_1",
                                                                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.webcontent-filter_filterpackets",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.webcontent-filter_filterpackets_false",
                                                                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.webcontent-filter_filtersockets",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.webcontent-filter_filtersockets_true",
                                                                                                                                         "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.webcontent-filter_organization",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "simpleSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "JAMF Software"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.webcontent-filter_pluginbundleid",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "simpleSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.microsoft.wdav"
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.webcontent-filter_userdefinedname",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "simpleSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "Microsoft Defender Content Filter"
                                                                                                                                     }
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00275\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/settings(\u00275\u0027)/settingDefinitions"
                     }
                 ],
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/microsoft.graph.assign"
                                },
    "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget":  {
                                                                       "title":  "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
                                                                       "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
                                                                   },
    "#microsoft.graph.createCopy":  {
                                        "title":  "microsoft.graph.createCopy",
                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/microsoft.graph.createCopy"
                                    },
    "#microsoft.graph.reorder":  {
                                     "title":  "microsoft.graph.reorder",
                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/microsoft.graph.reorder"
                                 },
    "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget":  {
                                                                          "title":  "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
                                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
                                                                      },
    "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget":  {
                                                                     "title":  "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
                                                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
                                                                 },
    "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy":  {
                                                                        "title":  "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
                                                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u0027f9a520f4-f948-48b5-ba81-2a24eb9f3cdc\u0027)/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
                                                                    }
}



